
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Услуги") Тогда
		Дата = ДанныеЗаполнения.Дата;
	Строка = СписокРасходов.Добавить();
	Строка.Сумма = ДанныеЗаполнения.СуммаПлатежей;
	 Строка.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Оплата Услуг");

		
	КонецЕсли;
	
	КонецПроцедуры

	Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвиженияДенежныхСредств Расход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРасходов Из СписокРасходов Цикл
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокРасходов.Номенклатура;
		Движение.Сумма = ТекСтрокаСписокРасходов.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
			КонецПроцедуры


	                                             